read_verilog Mux2x1_8Bits.v
hierarchy -check -top Mux2x1_8Bits

proc; opt; 

techmap -map test_map.v; opt

# mapea ffs de la biblioyeca cmos_cell
dfflibmap -liberty cmos_cells.lib

#mapea compuertas logicas de la biblioteca  cmos_cells.lib
abc -liberty  cmos_cells.lib

write_verilog Mux2x1_8Bits_estruct.v