read_verilog Recirculacion.v
hierarchy -check -top Recirculacion

proc; opt; 

techmap -map test_map.v; opt

# mapea ffs de la biblioyeca cmos_cell
dfflibmap -liberty cmos_cells.lib

#mapea compuertas logicas de la biblioteca  cmos_cells.lib
abc -liberty  cmos_cells.lib

write_verilog Recirculacion_estruct.v