read_verilog ParaleloSerial_IDL.v
hierarchy -check -top ParaleloSerial_IDL

proc; 

techmap -map test_map.v; 

# mapea ffs de la biblioTeca cmos_cell
dfflibmap -liberty cmos_cells.lib

#mapea compuertas logicas de la biblioteca  cmos_cells.lib
abc -liberty  cmos_cells.lib

write_verilog ParaleloSerial_IDL_estruct.v