read_verilog SerialParalelo.v
hierarchy -check -top SerialParalelo

proc; opt;

techmap -map test_map.v; opt

# mapea ffs de la biblioTeca cmos_cell
dfflibmap -liberty cmos_cells.lib

#mapea compuertas logicas de la biblioteca  cmos_cells.lib
abc -liberty  cmos_cells.lib

write_verilog SerialParalelo_estruct.v