read_verilog ParaleloSerial.v
hierarchy -check -top ParaleloSerial

proc; 

techmap -map test_map.v; 

# mapea ffs de la biblioTeca cmos_cell
dfflibmap -liberty cmos_cells.lib

#mapea compuertas logicas de la biblioteca  cmos_cells.lib
abc -liberty  cmos_cells.lib

write_verilog ParaleloSerial_estruct.v